[Killed] BlockStatement
src/Roller.ts:9:30
   // specifies the number of faces the die has. It must have at least 2 faces
   // so any invalid values should default to 6 to represent the common
   // six-sided die.
-  constructor(faces: number) {
-    if (faces >= 2) {
-      this._faces = faces;
-    } else {
-      this._faces = 6;
-    }
-  }
+  constructor(faces: number) {}
 
   // specifies which number should be rolled and returns the recorded roll.
killedBy: Roller constructor should create a six-sided die if no faces are provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:10:9
   // so any invalid values should default to 6 to represent the common
   // six-sided die.
   constructor(faces: number) {
-    if (faces >= 2) {
+    if (false) {
       this._faces = faces;
     } else {
killedBy: Roller constructor should create a die with the specified number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 6

[Killed] BlockStatement
src/Roller.ts:27:31
   //   3. the distribution should update the distribution record so that the
   //      key (value rolled) has an updated value that increases the number
   //      of rolls for that face by 1
-  roll(value: number): number {
-    if (value >= 1 && value <= this._faces) {
-      this._last = value;
-      if (this._distribution.has(value)) {
-        this._distribution.set(value, this._distribution.get(value) + 1);
-      } else {
-        this._distribution.set(value, 1);
-      }
-      return value;
-    } else {
-      return 0;
-    }
-  }
+  roll(value: number): number {}
 
   // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller roll should record a valid roll and update the distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:28:23
   //      key (value rolled) has an updated value that increases the number
   //      of rolls for that face by 1
   roll(value: number): number {
-    if (value >= 1 && value <= this._faces) {
+    if (value >= 1 && value > this._faces) {
       this._last = value;
       if (this._distribution.has(value)) {
killedBy: Roller roll should record a valid roll and update the distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:28:23
   //      key (value rolled) has an updated value that increases the number
   //      of rolls for that face by 1
   roll(value: number): number {
-    if (value >= 1 && value <= this._faces) {
+    if (value >= 1 && true) {
       this._last = value;
       if (this._distribution.has(value)) {
killedBy: Roller roll should not record an invalid roll and return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
src/Roller.ts:30:11
   roll(value: number): number {
     if (value >= 1 && value <= this._faces) {
       this._last = value;
-      if (this._distribution.has(value)) {
+      if (false) {
         this._distribution.set(value, this._distribution.get(value) + 1);
       } else {
killedBy: Roller distribution should return the distribution of rolls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/Roller.ts:30:11
   roll(value: number): number {
     if (value >= 1 && value <= this._faces) {
       this._last = value;
-      if (this._distribution.has(value)) {
+      if (true) {
         this._distribution.set(value, this._distribution.get(value) + 1);
       } else {
killedBy: Roller roll should record a valid roll and update the distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
src/Roller.ts:31:39
     if (value >= 1 && value <= this._faces) {
       this._last = value;
       if (this._distribution.has(value)) {
-        this._distribution.set(value, this._distribution.get(value) + 1);
+        this._distribution.set(value, this._distribution.get(value) - 1);
       } else {
         this._distribution.set(value, 1);
killedBy: Roller distribution should return the distribution of rolls
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/Roller.ts:32:14
       this._last = value;
       if (this._distribution.has(value)) {
         this._distribution.set(value, this._distribution.get(value) + 1);
-      } else {
-        this._distribution.set(value, 1);
-      }
+      } else {}
       return value;
     } else {
killedBy: Roller roll should record a valid roll and update the distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/Roller.ts:36:12
         this._distribution.set(value, 1);
       }
       return value;
-    } else {
-      return 0;
-    }
+    } else {}
   }
 
killedBy: Roller roll should not record an invalid roll and return 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
